spec/vcr_fixtures/PayLessonByTransfert/save_draft_lesson_and_create_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/oauth/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic cXdlcnRlYWNocmFpbHM6eGs0WUpMWnZ5S3N5QWJoN0Q3RlRNUk92ckZ6azQyMWZzRE9pRHhIUHJPNlNVYzBvUnA=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json;charset=UTF-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      Date:
      - Wed, 22 Mar 2017 20:05:37 GMT
      Content-Length:
      - '91'
    body:
      encoding: UTF-8
      string: '{"access_token":"8b24d99eb5a34fb1a3d3aa582b9b0abc","token_type":"bearer","expires_in":1199}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:42 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/natural
    body:
      encoding: UTF-8
      string: '{"CountryOfResidence":"HT","Nationality":"BO","Address":{"AddressLine1":"Muller
        Flat","AddressLine2":"887","PostalCode":"MK79 8TX","City":"Port Lionelfort","Region":"Kansas","Country":"AM"},"FirstName":"Kris","LastName":"Gorczany","Birthday":701197200,"Email":"blaine@heaney.info","PersonType":"NATURAL","Tag":"user
        5"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '121'
      - '192'
      - '3871'
      - '69'
      X-Ratelimit-Remaining:
      - '101729'
      - '2231'
      - '4379'
      - '8608'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:39 GMT
      Content-Length:
      - '462'
    body:
      encoding: UTF-8
      string: '{"Address":{"AddressLine1":"Muller Flat","AddressLine2":"887","City":"Port
        Lionelfort","Region":"Kansas","PostalCode":"MK79 8TX","Country":"AM"},"FirstName":"Kris","LastName":"Gorczany","Birthday":701197200,"Nationality":"BO","CountryOfResidence":"HT","Occupation":null,"IncomeRange":null,"ProofOfIdentity":null,"ProofOfAddress":null,"PersonType":"NATURAL","Email":"blaine@heaney.info","KYCLevel":"LIGHT","Id":"23105649","Tag":"user
        5","CreationDate":1490213138}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:45 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/wallets
    body:
      encoding: UTF-8
      string: '{"Owners":[23105649],"Currency":"EUR","Description":"wallet user 5"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '122'
      - '193'
      - '3872'
      - '70'
      X-Ratelimit-Remaining:
      - '101728'
      - '2230'
      - '4378'
      - '8607'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:40 GMT
      Content-Length:
      - '185'
    body:
      encoding: UTF-8
      string: '{"Description":"wallet user 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105650","Tag":null,"CreationDate":1490213140}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:45 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/wallets
    body:
      encoding: UTF-8
      string: '{"Owners":[23105649],"Currency":"EUR","Description":"wallet bonus 5","Tag":"Bonus"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '123'
      - '194'
      - '3873'
      - '71'
      X-Ratelimit-Remaining:
      - '101727'
      - '2229'
      - '4377'
      - '8606'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:40 GMT
      Content-Length:
      - '189'
    body:
      encoding: UTF-8
      string: '{"Description":"wallet bonus 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105651","Tag":"Bonus","CreationDate":1490213141}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:46 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/wallets
    body:
      encoding: UTF-8
      string: '{"Owners":[23105649],"Currency":"EUR","Description":"wallet transfert
        5","Tag":"Transfert"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '124'
      - '195'
      - '3874'
      - '72'
      X-Ratelimit-Remaining:
      - '101726'
      - '2228'
      - '4376'
      - '8605'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:41 GMT
      Content-Length:
      - '197'
    body:
      encoding: UTF-8
      string: '{"Description":"wallet transfert 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105652","Tag":"Transfert","CreationDate":1490213141}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:46 GMT
- request:
    method: get
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/cards?per_page=100&sort=CreationDate:desc
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      Link:
      - <https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/cards?sort=CreationDate%3adesc&per_page=100&page=1>;
        rel="first",<https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/cards?sort=CreationDate%3adesc&per_page=100&page=1>;
        rel="last"
      X-Number-Of-Pages:
      - '1'
      X-Number-Of-Items:
      - '0'
      X-Ratelimit:
      - '125'
      - '196'
      - '3875'
      - '73'
      X-Ratelimit-Remaining:
      - '101725'
      - '2227'
      - '4375'
      - '8604'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:41 GMT
      Content-Length:
      - '2'
    body:
      encoding: UTF-8
      string: "[]"
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:47 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/cardregistrations
    body:
      encoding: UTF-8
      string: '{"UserId":23105649,"Currency":"EUR","CardType":"CB_VISA_MASTERCARD"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '126'
      - '197'
      - '3876'
      - '74'
      X-Ratelimit-Remaining:
      - '101724'
      - '2226'
      - '4374'
      - '8603'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:42 GMT
      Content-Length:
      - '453'
    body:
      encoding: UTF-8
      string: '{"Id":"23105653","Tag":null,"CreationDate":1490213142,"UserId":"23105649","AccessKey":"1X0m87dmM2LiwFgxPLBJ","PreregistrationData":"HBalUf7sKsj1NiktfVS7-zAloXxdc4XUF9rrGyxC-rezv1vY1OThn_tbByHT40k0S4wCy-yiraxeE65tmxOe8A","RegistrationData":null,"CardId":null,"CardType":"CB_VISA_MASTERCARD","CardRegistrationURL":"https://homologation-webpayment.payline.com/webpayment/getToken","ResultCode":null,"ResultMessage":null,"Currency":"EUR","Status":"CREATED"}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:48 GMT
- request:
    method: post
    uri: https://homologation-webpayment.payline.com/webpayment/getToken
    body:
      encoding: US-ASCII
      string: accessKeyRef=1X0m87dmM2LiwFgxPLBJ&cardNumber=3569990000000132&cardExpirationDate=1017&cardCvx=131&data=HBalUf7sKsj1NiktfVS7-zAloXxdc4XUF9rrGyxC-rezv1vY1OThn_tbByHT40k0S4wCy-yiraxeE65tmxOe8A
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - homologation-webpayment.payline.com
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 22 Mar 2017 20:05:43 GMT
      Set-Cookie:
      - JSESSIONID=0E80E4A53E40768D419ADEA1595A9CD2; Path=/; Secure; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      Content-Length:
      - '155'
      Vary:
      - Accept-Encoding,User-Agent
      Content-Type:
      - text/plain; charset=UTF-8
    body:
      encoding: UTF-8
      string: data=VLTIjgpf1ag15dmwRyhmOUYkGSsjl8iV8v3IUwsaGTNAA6YUyaWchC6IPH68NkbknTdLZtcmg_M6FuNoqtdSSYu-eWoYj3xPfjeSE90-I0pzbi0fUIk9cA6BFhBBDIEGbX1XfWEJnpZqiQjOBiSApw
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:49 GMT
- request:
    method: put
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/cardregistrations/23105653
    body:
      encoding: UTF-8
      string: '{"RegistrationData":"data=data=VLTIjgpf1ag15dmwRyhmOUYkGSsjl8iV8v3IUwsaGTNAA6YUyaWchC6IPH68NkbknTdLZtcmg_M6FuNoqtdSSYu-eWoYj3xPfjeSE90-I0pzbi0fUIk9cA6BFhBBDIEGbX1XfWEJnpZqiQjOBiSApw"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '127'
      - '198'
      - '3877'
      - '75'
      X-Ratelimit-Remaining:
      - '101723'
      - '2225'
      - '4373'
      - '8602'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:44 GMT
      Content-Length:
      - '628'
    body:
      encoding: UTF-8
      string: '{"Id":"23105653","Tag":null,"CreationDate":1490213142,"UserId":"23105649","AccessKey":"1X0m87dmM2LiwFgxPLBJ","PreregistrationData":"HBalUf7sKsj1NiktfVS7-zAloXxdc4XUF9rrGyxC-rezv1vY1OThn_tbByHT40k0S4wCy-yiraxeE65tmxOe8A","RegistrationData":"data=data=VLTIjgpf1ag15dmwRyhmOUYkGSsjl8iV8v3IUwsaGTNAA6YUyaWchC6IPH68NkbknTdLZtcmg_M6FuNoqtdSSYu-eWoYj3xPfjeSE90-I0pzbi0fUIk9cA6BFhBBDIEGbX1XfWEJnpZqiQjOBiSApw","CardId":"23105654","CardType":"CB_VISA_MASTERCARD","CardRegistrationURL":"https://homologation-webpayment.payline.com/webpayment/getToken","ResultCode":"000000","ResultMessage":"Success","Currency":"EUR","Status":"VALIDATED"}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:49 GMT
- request:
    method: get
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      Link:
      - <https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets?page=1&per_page=10>;
        rel="first",<https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets?page=1&per_page=10>;
        rel="last"
      X-Number-Of-Pages:
      - '1'
      X-Number-Of-Items:
      - '3'
      X-Ratelimit:
      - '128'
      - '199'
      - '3878'
      - '76'
      X-Ratelimit-Remaining:
      - '101722'
      - '2224'
      - '4372'
      - '8601'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:45 GMT
      Content-Length:
      - '575'
    body:
      encoding: UTF-8
      string: '[{"Description":"wallet user 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105650","Tag":null,"CreationDate":1490213140},{"Description":"wallet
        bonus 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105651","Tag":"Bonus","CreationDate":1490213141},{"Description":"wallet
        transfert 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105652","Tag":"Transfert","CreationDate":1490213141}]'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:50 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/payins/card/direct
    body:
      encoding: UTF-8
      string: '{"AuthorId":23105649,"CreditedUserId":23105649,"DebitedFunds":{"Currency":"EUR","Amount":4900.0},"Fees":{"Currency":"EUR","Amount":0.0},"CreditedWalletId":"23105650","SecureModeReturnURL":"http://test.com","SecureMode":"DEFAULT","CardId":"23105654"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '129'
      - '200'
      - '3879'
      - '77'
      X-Ratelimit-Remaining:
      - '101721'
      - '2223'
      - '4371'
      - '8600'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:46 GMT
      Content-Length:
      - '618'
    body:
      encoding: UTF-8
      string: '{"Id":"23105655","Tag":null,"CreationDate":1490213146,"AuthorId":"23105649","CreditedUserId":"23105649","DebitedFunds":{"Currency":"EUR","Amount":4900},"CreditedFunds":{"Currency":"EUR","Amount":4900},"Fees":{"Currency":"EUR","Amount":0},"Status":"SUCCEEDED","ResultCode":"000000","ResultMessage":"Success","ExecutionDate":1490213147,"Type":"PAYIN","Nature":"REGULAR","CreditedWalletId":"23105650","DebitedWalletId":null,"PaymentType":"CARD","ExecutionType":"DIRECT","SecureMode":"DEFAULT","CardId":"23105654","SecureModeReturnURL":null,"SecureModeRedirectURL":null,"SecureModeNeeded":false,"StatementDescriptor":null}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:52 GMT
- request:
    method: get
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      Link:
      - <https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets?page=1&per_page=10>;
        rel="first",<https://api.sandbox.mangopay.com/v2.01/qwerteachrails/users/23105649/wallets?page=1&per_page=10>;
        rel="last"
      X-Number-Of-Pages:
      - '1'
      X-Number-Of-Items:
      - '3'
      X-Ratelimit:
      - '130'
      - '201'
      - '3880'
      - '78'
      X-Ratelimit-Remaining:
      - '101720'
      - '2222'
      - '4370'
      - '8599'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:48 GMT
      Content-Length:
      - '578'
    body:
      encoding: UTF-8
      string: '[{"Description":"wallet user 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":4900},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105650","Tag":null,"CreationDate":1490213140},{"Description":"wallet
        bonus 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105651","Tag":"Bonus","CreationDate":1490213141},{"Description":"wallet
        transfert 5","Owners":["23105649"],"Balance":{"Currency":"EUR","Amount":0},"Currency":"EUR","FundsType":"DEFAULT","Id":"23105652","Tag":"Transfert","CreationDate":1490213141}]'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:54 GMT
- request:
    method: post
    uri: https://api.sandbox.mangopay.com/v2.01/qwerteachrails/transfers
    body:
      encoding: UTF-8
      string: '{"AuthorId":23105649,"DebitedFunds":{"Currency":"EUR","Amount":2000.0},"Fees":{"Currency":"EUR","Amount":0.0},"DebitedWalletId":"23105650","CreditedWalletId":"23105652"}'
    headers:
      User-Agent:
      - MANGOPAY V2 RubyBindings/3.0.26
      Authorization:
      - bearer 8b24d99eb5a34fb1a3d3aa582b9b0abc
      Content-Type:
      - application/json
      X-Mangopay-Client-User-Agent:
      - '{"bindings_version":"3.0.26","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin16","uname":"Darwin
        MBP-MacBook.Dlink 16.0.0 Darwin Kernel Version 16.0.0: Mon Aug 29 17:56:20
        PDT 2016; root:xnu-3789.1.32~3/RELEASE_X86_64 x86_64"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Expires:
      - "-1"
      Server:
      - Leetchi
      X-Ratelimit:
      - '131'
      - '202'
      - '3881'
      - '79'
      X-Ratelimit-Remaining:
      - '101719'
      - '2221'
      - '4369'
      - '8598'
      X-Ratelimit-Reset:
      - '1490214000'
      - '1490214900'
      - '1490216700'
      - '1490299440'
      Date:
      - Wed, 22 Mar 2017 20:05:50 GMT
      Content-Length:
      - '430'
    body:
      encoding: UTF-8
      string: '{"Id":"23105657","Tag":null,"CreationDate":1490213149,"AuthorId":"23105649","CreditedUserId":"23105649","DebitedFunds":{"Currency":"EUR","Amount":2000},"CreditedFunds":{"Currency":"EUR","Amount":2000},"Fees":{"Currency":"EUR","Amount":0},"Status":"SUCCEEDED","ResultCode":"000000","ResultMessage":"Success","ExecutionDate":1490213149,"Type":"TRANSFER","Nature":"REGULAR","DebitedWalletId":"23105650","CreditedWalletId":"23105652"}'
    http_version: 
  recorded_at: Wed, 22 Mar 2017 20:05:55 GMT
recorded_with: VCR 3.0.3
